src/cf/Documents/InjectionBooking.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>InjectionBooking</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Owner</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.DogOwners</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Veterinarian</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Veterinarians</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>InjectionDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>DogList</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Dog</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Dogs</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Vaccine</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Vaccines</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Disease</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CoreDiseases</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>NextVaccination</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/InjectionBooking/Forms/DocumentForm/Ext/Form/Module.bsl
&AtClient
Procedure DogListDogStartChoice(Item, ChoiceData, StandardProcessing)
	ChoiceList=Item.ChoiceList;
	ChoiceList.Clear();
	ListDog = GetDogOfOwner(Object.Owner);
	TabularDogList = New Array;
	For Each Line In object.DogList Do
		If ValueIsFilled(Line.Dog) Then
			TabularDogList.Add(Line.Dog); 
		EndIf; 
	EndDo; 	
	For Each Dog In ListDog  Do
		Check =True;
		For Each DogIntabular In TabularDogList Do
			If Dog =DogIntabular Then
				Check =False;
			EndIf; 
		EndDo; 
		If Check Then
			ChoiceList.Add(Dog);
		EndIf;
	EndDo;
	If Item.ChoiceList.Count()=0 Then
		If ValueIsFilled(Object.Owner) Then
			Message(String(Object.Owner)+" have no other dogs");
		Else
			Message("Please select Owner");
		EndIf; 
	EndIf; 
EndProcedure

Function GetDogOfOwner(Owner)
		
	Query = New Query;
	Query.Text = 
	"SELECT
	|	Dogs.Ref AS Ref
	|FROM
	|	Catalog.Dogs AS Dogs
	|WHERE
	|	Dogs.Owner = &Owner";
	
	Query.SetParameter("Owner", Owner);
	
	QueryResult = Query.Execute();
	
	SelectionDetailRecords = QueryResult.Select();
	ListDog = new Array;
	While SelectionDetailRecords.Next() Do
		ListDog.Add(SelectionDetailRecords.Ref);
	EndDo;
	
	Return ListDog;

EndFunction
